{
    "hi": "Hello! How can I help you today",
    "how do I create a list in Python": "Use square brackets, e.g., my_list = [1, 2, 3].",
    "what is the difference between a tuple and a list in Python": "Lists are mutable; tuples are immutable.",
    "how can I merge two dictionaries in Python": "Use dict1.update(dict2) or {**dict1, **dict2}.",
    "what is the purpose of a JSON file": "To store and exchange data in a structured, readable format.",
    "how do I reverse a string in Python": "Use slicing: reversed_str = my_str[::-1].",
    "what is the ideal wavelength for colorimetric estimation of copper": "Around 620 nm.",
    "how do you calculate the amount of substance from molarity and volume": "n = M × V (moles = molarity × volume in liters).",
    "what is the gram equivalent weight of HCl": "36.46 g/mol (for acid-base reactions, n=1).",
    "how is the zero-point energy of a molecule calculated": "E₀ = (1/2) hν per vibrational mode.",
    "why is water used as a solvent in many chemical reactions": "It is polar, abundant, and dissolves many substances.",
    "how do I calculate the sum of an arithmetic series": "S = n/2 × (a₁ + aₙ).",
    "what is the difference between scalar and vector quantities": "Scalars have magnitude only; vectors have magnitude and direction.",
    "how do you find the roots of a quadratic equation": "Use x = (-b ± √(b² - 4ac)) / 2a.",
    "what is the formula for the energy levels of a quantum harmonic oscillator": "E_v = (v + 1/2) hν.",
    "how is rotational energy of a molecule determined": "E_J = B J (J + 1) (B = rotational constant, J = rotational quantum number).",
    "who wrote 'Pride and Prejudice'": "Jane Austen.",
    "what is the largest planet in our solar system": "Jupiter.",
    "what are the main functions of the human liver": "Detoxification, bile production, metabolism of nutrients.",
    "how does photosynthesis work": "Plants convert CO₂ + H₂O → glucose + O₂ using sunlight.",
    "what is the capital city of karnataka ?": "The capital city of Karnataka is Bengaluru",
    "what is the capital of india": "The capital of India is New Delhi",
    "what is the chemical name of chloroform": "trichloromethane",
    "what is the capital city of karnataka": "The capital of karnataka is bengaluru",
    "i want you to lose yourself": "ur gay",
    "hello": "hello how can i help you today"
}